import Plus from '@/icons/Plus.svg?react';
import Modal from '@/ui/Modal/Modal.tsx'
import { useState } from "react";
// import Portal from "@/ui/Portal/Portal.tsx";
import {DataTable} from "@/ui/data-table/DataTable.tsx";

export default function Dashboard() {

    const [open, setOpen] = useState(false);

    type Props = {
        value: number;
    };

    function MoneyValue({
                                           value,
                                       }: Props) {

        if (value > 0) {
            return (
                <span dir={'ltr'} className="text-green-600">
                +{value.toLocaleString()}
            </span>
            );
        }

        if (value < 0) {
            return (
                <span dir={'ltr'} className="text-red-600">
                {value.toLocaleString()}
            </span>
            );
        }

        return (
            <span dir={'ltr'} className="text-gray-900">

        </span>
        );
    }


    type Transaction = {
        id: number;
        customer: string;
        toman: number;
        dollar: number;
        dinar: number;
        date: string;
        description: string;
    };

    const transactions: Transaction[] = [
        {id: 1, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 2, customer: 'ناظم عبدالامیر محمد هاشم', toman: -200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 3, customer: 'ناظم عبدالامیر محمد هاشم', toman: 0, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 4, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 5, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 6, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 7, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 8, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 9, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 10, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 11, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 12, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 13, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 14, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 15, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 16, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 17, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 18, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 19, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 20, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
        {id: 21, customer: 'ناظم عبدالامیر محمد هاشم', toman: 200000, dollar: 100,dinar: 110000, date: '04/11/24', description:' 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک.. 05/03/27 باید به فلانی زنگ بزنم بگم که فلان و ازش بپرسم که چرا فلان نکرده . باید باهاش صحبت ک..'},
    ];

    const columns: Column<Transaction>[] = [
        {
            key: "customer",
            title: "نام مشتری",
            render: (value: string) => (
                <div
                    className="
                truncate
                text-gray-600
                max-w-1
            "
                    title={String(value)}
                >
                    {String(value)}
                </div>
            ),
        },

        {
            key: "toman",
            title: "تومان",

            render: (value: number) => (
                <MoneyValue value={Number(value)} />
            ),
        },

        {
            key: "dollar",
            title: "دلار",

            render: (value: number) => (
                <MoneyValue value={Number(value)} />
            ),
        },

        {
            key: "dinar",
            title: "دینار",

            render: (value: number) => (
                <MoneyValue value={Number(value)} />
            ),
        },

        {
            key: "date",
            title: "تاریخ",
        },
        {
            key: "description",
            title: "توضیحات",
            render: (value: string) => (
                <div
                    className="
                truncate
                text-gray-600

            "
                    title={String(value)}
                >
                    {String(value)}
                </div>
            ),
        },
    ];

    return <div className={''} dir={'rtl'}>
        <div className="flex hidden">
            <div className={'flex bg-green-400 text-white rounded-lg px-9 py-4 hover:bg-green-500 cursor-pointer transition duration-200 select-none'}>
                <button className={'cursor-pointer'}>افزودن مشتری</button>
                <Plus className={'mr-4'}/>
            </div>
            <div className={'flex mr-8 bg-purple-400 text-white rounded-lg px-9 py-4 hover:bg-purple-500 cursor-pointer transition duration-200 select-none'}>
                <button className={'cursor-pointer'}>افزودن حساب</button>
                <Plus className={'mr-4'}/>
            </div>
        </div>
        <div>
            <button onClick={() => setOpen(true)} className={'hidden rounded bg-blue-500 px-4 py-2 text-white'}>Open Modal</button>
            <Modal open={open} onClose={() => setOpen(false)} title={'Hello Globe'}>
                <p className="text-sm text-gray-600">
                    This is your first UI Kit modal 🚀
                </p>

                <div className="mt-4 flex justify-end gap-2">
                    <button
                        className="rounded px-3 py-1 text-gray-600"
                        onClick={() => setOpen(false)}
                    >
                        Cancel
                    </button>

                    <button className="rounded bg-blue-500 px-3 py-1 text-white">
                        Confirm
                    </button>
                </div>
            </Modal>
            <div>
                <DataTable
                    rowKey="id"
                    columns={columns}
                    data={transactions}
                    loading={false}
                />
            </div>
        </div>
        <div>

        </div>
    </div>;
}